Re500_transient/simulation/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// FDA Nozzle Benchmark - Case 1 (Re = 500, Laminar)
// O-Grid with CONICAL COLLECTOR and SUDDEN EXPANSION
// 
// Outlet has 3 radial vertex rings at both inlet and outlet faces:
// - Inner (center jet core)
// - Middle (jet shear layer matching throat outer)
// - Outer (outlet wall)

scale   1;

vertices
(
    // ============== ZONE 1: INLET (z = 0 to 0.06) ==============
    ( -0.001697 -0.001697 0.0 )         // 0
    (  0.001697 -0.001697 0.0 )         // 1
    (  0.001697  0.001697 0.0 )         // 2
    ( -0.001697  0.001697 0.0 )         // 3
    ( -0.004243 -0.004243 0.0 )         // 4
    (  0.004243 -0.004243 0.0 )         // 5
    (  0.004243  0.004243 0.0 )         // 6
    ( -0.004243  0.004243 0.0 )         // 7
    
    ( -0.001697 -0.001697 0.06 )        // 8
    (  0.001697 -0.001697 0.06 )        // 9
    (  0.001697  0.001697 0.06 )        // 10
    ( -0.001697  0.001697 0.06 )        // 11
    ( -0.004243 -0.004243 0.06 )        // 12
    (  0.004243 -0.004243 0.06 )        // 13
    (  0.004243  0.004243 0.06 )        // 14
    ( -0.004243  0.004243 0.06 )        // 15
    
    // ============== ZONE 2: COLLECTOR (z = 0.06 to 0.082685) ==============
    ( -0.000566 -0.000566 0.082685 )    // 16
    (  0.000566 -0.000566 0.082685 )    // 17
    (  0.000566  0.000566 0.082685 )    // 18
    ( -0.000566  0.000566 0.082685 )    // 19
    ( -0.001414 -0.001414 0.082685 )    // 20
    (  0.001414 -0.001414 0.082685 )    // 21
    (  0.001414  0.001414 0.082685 )    // 22
    ( -0.001414  0.001414 0.082685 )    // 23
    
    // ============== ZONE 3: THROAT (z = 0.082685 to 0.122685) ==============
    ( -0.000566 -0.000566 0.122685 )    // 24 - inner
    (  0.000566 -0.000566 0.122685 )    // 25
    (  0.000566  0.000566 0.122685 )    // 26
    ( -0.000566  0.000566 0.122685 )    // 27
    ( -0.001414 -0.001414 0.122685 )    // 28 - outer
    (  0.001414 -0.001414 0.122685 )    // 29
    (  0.001414  0.001414 0.122685 )    // 30
    ( -0.001414  0.001414 0.122685 )    // 31
    
    // ============== ZONE 4: OUTLET INLET FACE (z = 0.122685) ==============
    // Inner ring - coincident with throat inner (24-27)
    ( -0.000566 -0.000566 0.122685 )    // 32
    (  0.000566 -0.000566 0.122685 )    // 33
    (  0.000566  0.000566 0.122685 )    // 34
    ( -0.000566  0.000566 0.122685 )    // 35
    // Outer ring - at outlet wall
    ( -0.004243 -0.004243 0.122685 )    // 36
    (  0.004243 -0.004243 0.122685 )    // 37
    (  0.004243  0.004243 0.122685 )    // 38
    ( -0.004243  0.004243 0.122685 )    // 39
    // Middle ring - coincident with throat outer (28-31)
    ( -0.001414 -0.001414 0.122685 )    // 40
    (  0.001414 -0.001414 0.122685 )    // 41
    (  0.001414  0.001414 0.122685 )    // 42
    ( -0.001414  0.001414 0.122685 )    // 43
    
    // ============== ZONE 4: OUTLET EXIT FACE (z = 0.242685) ==============
    // Inner ring
    ( -0.001697 -0.001697 0.242685 )    // 44
    (  0.001697 -0.001697 0.242685 )    // 45
    (  0.001697  0.001697 0.242685 )    // 46
    ( -0.001697  0.001697 0.242685 )    // 47
    // Outer ring
    ( -0.004243 -0.004243 0.242685 )    // 48
    (  0.004243 -0.004243 0.242685 )    // 49
    (  0.004243  0.004243 0.242685 )    // 50
    ( -0.004243  0.004243 0.242685 )    // 51
    // Middle ring (interpolated position for smooth expansion)
    ( -0.002828 -0.002828 0.242685 )    // 52
    (  0.002828 -0.002828 0.242685 )    // 53
    (  0.002828  0.002828 0.242685 )    // 54
    ( -0.002828  0.002828 0.242685 )    // 55
);

blocks
(
    // ============== ZONE 1: INLET (5 blocks) ==============
    hex (0 1 2 3 8 9 10 11)
    (4 4 30)
    simpleGrading (1 1 1)
    
    hex (0 4 5 1 8 12 13 9)
    (12 4 30)
    simpleGrading (0.25 1 1)
    
    hex (1 5 6 2 9 13 14 10)
    (12 4 30)
    simpleGrading (0.25 1 1)
    
    hex (2 6 7 3 10 14 15 11)
    (12 4 30)
    simpleGrading (0.25 1 1)
    
    hex (3 7 4 0 11 15 12 8)
    (12 4 30)
    simpleGrading (0.25 1 1)
    
    // ============== ZONE 2: COLLECTOR (5 blocks) ==============
    hex (8 9 10 11 16 17 18 19)
    (4 4 25)
    simpleGrading (1 1 1)
    
    hex (8 12 13 9 16 20 21 17)
    (12 4 25)
    simpleGrading (0.25 1 1)
    
    hex (9 13 14 10 17 21 22 18)
    (12 4 25)
    simpleGrading (0.25 1 1)
    
    hex (10 14 15 11 18 22 23 19)
    (12 4 25)
    simpleGrading (0.25 1 1)
    
    hex (11 15 12 8 19 23 20 16)
    (12 4 25)
    simpleGrading (0.25 1 1)
    
    // ============== ZONE 3: THROAT (5 blocks) ==============
    hex (16 17 18 19 24 25 26 27)
    (4 4 40)
    simpleGrading (1 1 0.2)
    
    hex (16 20 21 17 24 28 29 25)
    (12 4 40)
    simpleGrading (0.25 1 0.2)
    
    hex (17 21 22 18 25 29 30 26)
    (12 4 40)
    simpleGrading (0.25 1 0.2)
    
    hex (18 22 23 19 26 30 31 27)
    (12 4 40)
    simpleGrading (0.25 1 0.2)
    
    hex (19 23 20 16 27 31 28 24)
    (12 4 40)
    simpleGrading (0.25 1 0.2)
    
    // ============== ZONE 4: OUTLET (9 blocks) ==============
    // Center block
    hex (32 33 34 35 44 45 46 47)
    (4 4 60)
    simpleGrading (1 1 2.0)
    
    // Inner ring (jet shear layer) - from center to middle ring
    hex (32 40 41 33 44 52 53 45)
    (12 4 60)
    simpleGrading (0.25 1 2.0)
    
    hex (33 41 42 34 45 53 54 46)
    (12 4 60)
    simpleGrading (0.25 1 2.0)
    
    hex (34 42 43 35 46 54 55 47)
    (12 4 60)
    simpleGrading (0.25 1 2.0)
    
    hex (35 43 40 32 47 55 52 44)
    (12 4 60)
    simpleGrading (0.25 1 2.0)
    
    // Outer ring (recirculation zone) - from middle to outer ring
    hex (40 36 37 41 52 48 49 53)
    (12 4 60)
    simpleGrading (0.25 1 2.0)
    
    hex (41 37 38 42 53 49 50 54)
    (12 4 60)
    simpleGrading (0.25 1 2.0)
    
    hex (42 38 39 43 54 50 51 55)
    (12 4 60)
    simpleGrading (0.25 1 2.0)
    
    hex (43 39 36 40 55 51 48 52)
    (12 4 60)
    simpleGrading (0.25 1 2.0)
);

edges
(
    // Inlet arcs
    arc 4 5 ( 0 -0.006 0.0 )
    arc 5 6 ( 0.006 0 0.0 )
    arc 6 7 ( 0 0.006 0.0 )
    arc 7 4 ( -0.006 0 0.0 )
    
    arc 12 13 ( 0 -0.006 0.06 )
    arc 13 14 ( 0.006 0 0.06 )
    arc 14 15 ( 0 0.006 0.06 )
    arc 15 12 ( -0.006 0 0.06 )
    
    // Collector splines
    spline 12 20
    (
        ( -0.004243 -0.004243 0.06 )
        ( -0.002828 -0.002828 0.071343 )
        ( -0.001414 -0.001414 0.082685 )
    )
    spline 13 21
    (
        (  0.004243 -0.004243 0.06 )
        (  0.002828 -0.002828 0.071343 )
        (  0.001414 -0.001414 0.082685 )
    )
    spline 14 22
    (
        (  0.004243  0.004243 0.06 )
        (  0.002828  0.002828 0.071343 )
        (  0.001414  0.001414 0.082685 )
    )
    spline 15 23
    (
        ( -0.004243  0.004243 0.06 )
        ( -0.002828  0.002828 0.071343 )
        ( -0.001414  0.001414 0.082685 )
    )
    
    arc 20 21 ( 0 -0.002 0.082685 )
    arc 21 22 ( 0.002 0 0.082685 )
    arc 22 23 ( 0 0.002 0.082685 )
    arc 23 20 ( -0.002 0 0.082685 )
    
    // Throat arcs
    arc 28 29 ( 0 -0.002 0.122685 )
    arc 29 30 ( 0.002 0 0.122685 )
    arc 30 31 ( 0 0.002 0.122685 )
    arc 31 28 ( -0.002 0 0.122685 )
    
    // Outlet inlet middle ring arcs
    arc 40 41 ( 0 -0.002 0.122685 )
    arc 41 42 ( 0.002 0 0.122685 )
    arc 42 43 ( 0 0.002 0.122685 )
    arc 43 40 ( -0.002 0 0.122685 )
    
    // Outlet inlet outer arcs
    arc 36 37 ( 0 -0.006 0.122685 )
    arc 37 38 ( 0.006 0 0.122685 )
    arc 38 39 ( 0 0.006 0.122685 )
    arc 39 36 ( -0.006 0 0.122685 )
    
    // Outlet exit middle ring arcs
    arc 52 53 ( 0 -0.004 0.242685 )
    arc 53 54 ( 0.004 0 0.242685 )
    arc 54 55 ( 0 0.004 0.242685 )
    arc 55 52 ( -0.004 0 0.242685 )
    
    // Outlet exit outer arcs
    arc 48 49 ( 0 -0.006 0.242685 )
    arc 49 50 ( 0.006 0 0.242685 )
    arc 50 51 ( 0 0.006 0.242685 )
    arc 51 48 ( -0.006 0 0.242685 )
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (3 2 1 0)
            (0 1 5 4)
            (1 2 6 5)
            (2 3 7 6)
            (3 0 4 7)
        );
    }
    
    outlet
    {
        type patch;
        faces
        (
            (44 45 46 47)
            (45 44 52 53)
            (46 45 53 54)
            (47 46 54 55)
            (44 47 55 52)
            (53 52 48 49)
            (54 53 49 50)
            (55 54 50 51)
            (52 55 51 48)
        );
    }
    
    wallInlet
    {
        type wall;
        faces
        (
            (4 5 13 12)
            (5 6 14 13)
            (6 7 15 14)
            (7 4 12 15)
        );
    }
    
    wallCollector
    {
        type wall;
        faces
        (
            (12 13 21 20)
            (13 14 22 21)
            (14 15 23 22)
            (15 12 20 23)
        );
    }
    
    wallThroat
    {
        type wall;
        faces
        (
            (20 21 29 28)
            (21 22 30 29)
            (22 23 31 30)
            (23 20 28 31)
        );
    }
    
    wallOutlet
    {
        type wall;
        faces
        (
            (36 37 49 48)
            (37 38 50 49)
            (38 39 51 50)
            (39 36 48 51)
        );
    }
    
    // Step expansion wall - inlet faces of outer ring blocks
    stepExpansion
    {
        type wall;
        faces
        (
            (40 36 37 41)
            (41 37 38 42)
            (42 38 39 43)
            (43 39 36 40)
        );
    }
    
    // Internal patches for merging
    throatOutletCenter
    {
        type patch;
        faces
        (
            (24 25 26 27)
        );
    }
    
    throatOutletOuter
    {
        type patch;
        faces
        (
            (24 28 29 25)
            (25 29 30 26)
            (26 30 31 27)
            (27 31 28 24)
        );
    }
    
    outletInletCenter
    {
        type patch;
        faces
        (
            (35 34 33 32)
        );
    }
    
    outletInletInner
    {
        type patch;
        faces
        (
            (32 40 41 33)
            (33 41 42 34)
            (34 42 43 35)
            (35 43 40 32)
        );
    }
);

mergePatchPairs
(
    ( throatOutletCenter outletInletCenter )
    ( throatOutletOuter outletInletInner )
);

// ************************************************************************* //
